# Программа "Калькулятор кредитов" Рассчитайте месячные выплаты (m) и суммарную выплату (s) по кредиту. 
# О кредите известно, что он составляет n рублей, берется на y лет, под p процентов. 
# Месячные выплаты находятся по формуле: m = (n * p * (1 + p)y) / (12 * ((1 + p)y – 1)), 
# где p выражается в долях единицы, а не процентах. 
# Суммарная выплата представляет собой выплаты за все месяцы каждого года: s = (m * 12) * y 
# Запросите размер кредита в рублях и копейках, количество целых лет (в годах) и 
# процентную ставку в процентах с точностью до сотых. 
# Распечатайте месячные выплаты и сумму кредита в рублях и копейках.
# Пример:

# Введите сумму кредита (рубли и копейки): 543.25
# Введите срок кредита в годах (целое число): 2
# Введите процентную ставку в процентах с точностью до сотых (без знака "%"): 
# 7.45 Месячные выплаты составят 25.2 руб. Суммарная выплата равна 604.68 руб.